ci4/app/Controllers/Artikel.php

SELECT `artikel`.*, `kategori`.`nama_kategori`
FROM `artikel`
LEFT JOIN `kategori` ON `kategori`.`id_kategori` = `artikel`.`id_kategori`
---
   public function admin_index()
{
    $model = new \App\Models\ArtikelModel();
    $q = $this->request->getVar('q');

    $builder = $model->table('artikel')
                     ->select('artikel.*, kategori.nama_kategori')
                     ->join('kategori', 'kategori.id_kategori = artikel.id_kategori', 'left');

    if ($q) $builder->like('artikel.judul', $q);
    $data['artikel'] = $builder->findAll();