ci4/app/Controllers/Post.php

    public function index()
    {
        $model = new ArtikelModel();
        $data['artikel'] = $model->orderBy('id', 'DESC')->findAll();
---
SELECT *
FROM `artikel`
ORDER BY `id` DESC

    public function create()
    {
        $model = new ArtikelModel();
        $json = $this->request->getJSON(true);
        $data = [
            'judul'  => $json['judul']  ?? $this->request->getVar('judul'),
            'isi'    => $json['isi']    ?? $this->request->getVar('isi'),
            'status' => $json['status'] ?? $this->request->getVar('status') ?? 0,
        ];
        $model->insert($data);
---
INSERT INTO `artikel` (`judul`, `isi`, `status`) VALUES ('III', 'YYY', 0)

    public function delete($id = null)
    {
        $model = new ArtikelModel();
        $data = $model->where('id', $id)->first();
        if ($data) {
            $model->delete($id);
---
SELECT *
FROM `artikel`
WHERE `id` = '22'
 LIMIT 1
DELETE FROM `artikel`
WHERE `id` IN ('22')